{
  "metadata": {
    "document_type": "Game Rules",
    "category": "Core Roleplay Guidelines",
    "last_updated": "09/20/2025",
    "server": "XLANTIS CITY ROLEPLAY"
  },
  "overview": "",
  "sections": [
    {
      "title": "OVERVIEW",
      "subsections": [],
      "description": "The following mentioned rules are guidelines to be followed by the players of XLANTIS CITY. They cover the basic Roleplay Guidelines to keep everyone's roleplay experience smooth and healthy."
    },
    {
      "title": "GENERAL ROLEPLAY GUIDELINES",
      "subsections": [
        {
          "title": "Character and Identity",
          "rules": [
            "Character Models with nudity are permitted but please keep in mind that people do stream. In addition, you can be arrested for Indecent Exposure (in real life)-(Server will not be responsible)",
            "Your Fivem name should be relatable to your discord name or character name",
            "Be honest and transparent about your identity. Introduce yourself and let others know who you are. Faking a character (wearing a mask and using a voice changer) to create unwanted situations to provoke fellow players will lead to ban",
            "Getting your Account Banned & Re-Joining the Server with a Different Account will lead to permanent ban"
          ]
        },
        {
          "title": "Weapons and Safety",
          "rules": [
            "Weapons must be holstered at all times. Brandishing any Weapon in City Limits is Illegal",
            "Avoid any unwanted death scenario friendly kills, death matches",
            "Intentionally jumping in front of a vehicle to be killed will not be considered a valid gameplay tactic, and players may not call it as a VDM"
          ]
        },
        {
          "title": "Communication",
          "rules": [
            "Voice IDing isn't allowed",
            "Respect other players' boundaries and privacy. Do not share personal information about others without their consent",
            "Treat others with kindness and respect. Avoid engaging in behavior that could be seen as harassing, intimidating, or threatening",
            "Take responsibility for your actions. If you have caused harm or upset to other players, apologize and make amends",
            "Online interactions can have real-life consequences, so it is important to be mindful of your behavior and how it affects others"
          ]
        },
        {
          "title": "Asset Management",
          "rules": [
            "Transferring assets such as money, weapons or vehicles between your different characters is forbidden. This includes the use of middlemen who may also be punished",
            "During pursuit you should not use the valet service to get your vehicle"
          ]
        },
        {
          "title": "Situational Rules",
          "rules": [
            "Firing towards a safe zone, or Stealing vehicles from a safe zone will be considered as FRP",
            "Gangs are not allowed to create an unnecessary situation with civilians and vice versa. Civilians are not allowed to involve any gang or gang members into their situation and vice versa",
            "Killing a player during their work time or while grinding at illegal areas will not be allowed. This area is considered as a green zone and killing a player or taking hostage at these areas will be considered as FRP",
            "Player cannot re enter a situation once he is dead",
            "In the case of a rule break do not break character. Finish roleplaying the situation and then submit a FRP ticket in our discord with as much evidence as you can provide"
          ]
        },
        {
          "title": "Water and Escape Rules",
          "rules": [
            "In a robbery situation, if it ends in water, the police will use announcements to call the robber to shore. The robber should then return and surrender to the police in this scenario",
            "Robbers can however, use boats and water based vehicles to escape if the escape RP has been pre-planned. You can only swim in the water for 5 Mins"
          ]
        }
      ]
    },
    {
      "title": "CORE ROLEPLAY CONCEPTS",
      "subsections": [
        {
          "title": "1. OOC / Out of Character",
          "rules": [
            "Avoid OOC conversation in-game. Any kind of OOC talks in the city towards a player will be considered as an FRP. This can include the mentioning of the Rules or mentioning \"RP\" within the city",
            "Talking while dead or using /me while knocked or dead is an FRP",
            "/me usage is only restricted to RP integrations, such as \"taking out wallet\" where an asterisk is used to imitate an action OR when your mic is bugged to communicate with a player in a respectful manner. All other uses will fall under OOC",
            "However, /me and OOC can be used in some limited situations to make \"FUN RPs\" if both parties are willing to do this. If a Roleplay Violation Ticket has been raised this point will not be applicable"
          ],
          "description": "Out Of Character means you are writing as yourself, the player, in the chat, not as your In-game character."
        },
        {
          "title": "2. Meta Gaming",
          "rules": [
            "The use of Discord Calls and Chats, External Communication to pass on information of a situation that is on-going and so on will count as Meta Gaming",
            "This includes the use of in-game playable missions (example Boombox) to stream and snipe someone's livestream"
          ],
          "description": "Metagaming is the use of any kind of knowledge not readily available to your character."
        },
        {
          "title": "3. Stream Sniping",
          "rules": [],
          "description": "Stream Sniping refers to the use of someone else's stream to gain an advantage in an RP scenario or disrupt an RP scenario or involve yourself in an RP scenario that you are not involved in or in the area to witness and take part in."
        },
        {
          "title": "4. Disconnecting/Crashing or Acting AFK",
          "rules": [
            "Intentionally crashing your game or disconnecting from the server via commands or removing or disconnecting your connection is punishable by Ban Periods depending on the situation",
            "If unintentional, make an attempt to contact a member of the Staff or the players involved in the situation and let them know",
            "In an active situation, if you disconnect, you cannot re-enter that situation as it significantly impacts the flow of that situation. (Refer Robbery Rules for additional information)",
            "However, unexpected technical issues are understandable. If you encounter such a case, report to the discord and inform the staff when you can spawn back in the same area. You are required to keep the POV of the disconnect"
          ]
        },
        {
          "title": "5. Safezone and Safezone Violations",
          "rules": [
            "Main Garage",
            "Ocean Highway Garage",
            "Business Locations",
            "The Police Headquarters and Locations",
            "The Hospital Zones",
            "Mr.X Headquarters",
            "The TDM/FFA Arenas and Lobby Area (9006)",
            "City Hall (and Court)",
            "Whitelisted Job Locations",
            "Jail (including Admin Jail)",
            "Impound",
            "Special Event Locations",
            "Gang Houses",
            "When in a safezone you are not allowed to create or involve yourself in a situation. Similarly, you are not allowed to enter a safe zone during an active situation to avoid the consequences",
            "If the situation has been triggered from the Green zone then both parties should leave the area in 10 minutes",
            "Kidnapping or initiating RP with a person who is doing community service or has just been released from jail is also considered a Fail RP",
            "If a group of players trigger the Police and start firing towards the Police, the Police are allowed to shoot from in to out of the building to defend themselves, they must look to clear the area of the hostile party but cannot remain within the safezone for more than 15Mins",
            "Additional to this case, only those who were in the area (on the hostile side) may be involved in the firing. No additional players may join the firing (regardless if the entire group was in the Radio or Team)"
          ],
          "description": "Safezones are zones of peace and meant for positive interactions and gatherings."
        },
        {
          "title": "6. Fear Roleplay",
          "rules": [
            "Nearly every character would find themselves afraid if held at gunpoint or threatened with obvious death. While you might play smart, you must still comply with the enemy's demands & avoid death for as long as possible. If the situation changes, such as if the enemy no longer has Weapons Pointed at you, you can stop being afraid",
            "Players are required to show Fear RP towards Police Officers whether it is a single Police Officer or multiple. This does not mean that the PD can misuse this power to favor their RP or create vulgar situations"
          ],
          "description": "Players must show appropriate care and concern for their character's safety and life. This rule aims for balanced gameplay."
        },
        {
          "title": "7. Random DeathMatch (RDM)",
          "rules": [
            "Killing without giving proper time to react is still counted as RDM",
            "Killing without giving the victim the exact reason as to why he is going to be killed will count as RDM",
            "No attacking or engaging in combat with another player without verbal RP interaction or being initiated into combat first. You must give sufficient RP and counter play before shooting"
          ],
          "description": "RDM stands for Random Death Match. RDM occurs when either you kill someone, or someone else kills you without any valid reason or roleplaying events leading up to it."
        },
        {
          "title": "8. Vehicle DeathMatch (VDM)",
          "rules": [
            "If you accidentally kill someone with a vehicle, apologize to them and wait till they're revived before leaving (Basic Decency)",
            "However, we have an anti-VDM system, if you purposefully commit VDM, you will be auto-kicked"
          ],
          "description": "VDM stands for Vehicle Death Match. Attacking another player/group using a Vehicle with the intent to kill/knock them out without valid reasoning or initiation counts as VDM."
        },
        {
          "title": "9. Warning Fire",
          "rules": [
            "It should be done in the same direction as the person who is going to be attacked and should not hurt the player. You can fire at the ground or sky. At least a count of 3 bullets must be fired as a warning shot",
            "You can stop the warning fire and engage the opponent if they have drawn their gun and are ready to fire. The warning fire must be visible from the point of view of the person who is going to be attacked",
            "If it's an ongoing situation, you can avoid the warning fire (It is only applicable to a situation in a continued timeline, if the timeline breaks, you must re-initiate the warning fire. That is, if the situation starts in the morning and the timeline breaks and all players rejoin the city in the evening, the warning fire must be re-initiated.)"
          ]
        },
        {
          "title": "10. Power Gaming",
          "rules": [],
          "description": "Power gaming is a term that is used to describe the usage of in-game mechanics, external information, or a roleplay concept that gives you an added advantage to your own story or roleplay character."
        },
        {
          "title": "11. Combat Logging",
          "rules": [
            "\"Connection Timed Out\" crashes will also count as Combat Logging if you fail to return to the location or inform the Staff with proof"
          ]
        },
        {
          "title": "12. New Life Rule",
          "rules": [
            "If a player dies and respawns in a hospital or is revived by a bot EMS or an Admin, they must follow the New Life Rule",
            "Bodies burnt by the opposite team during a situation should respawn and NLR will be applicable (If the enemy pours petrol on your body and they set fire to it, you must respawn irrespective of whether you body has been burnt in your POV or not)",
            "However, in Gang Situations, the Gang can be involved in the situation where their fellow member is killed, if they have received proper information from an eye witness. The proper POV of this communication must be available from the Gang side and the informant side"
          ],
          "description": "This means that the player's character forgets knowledge of various information learned before dying, including Names, Characters, unusual locations or information gained from investigations."
        },
        {
          "title": "13. Cop Baiting",
          "rules": [
            "Borderline Vulgar talks towards to PD Officer to get them to react in a negative way (Powergaming, Lorebreaking)",
            "Interfering in an ongoing Robbery (while in chase or not) to trigger your own scenario (Lore Breaking)",
            "Pitting Police Vehicles without any prior situation"
          ],
          "description": "Creating an Unwanted Situation with the Police for the sake of initiating a firing situation/chase will be considered as Cop Baiting."
        },
        {
          "title": "14. Lore Breaking",
          "rules": []
        },
        {
          "title": "15. Bot Revive Policy",
          "rules": [
            "The only way to continue the scenario is if someone who is not at all involved in the scenario but has seen your death, tells you that so and so person has killed you. Teammates cannot tell you of the situation, rejoining the Radio and going back into the situation is not an applicable cause of Bot Revive Policy",
            "If a person has been killed once by a hostile team, the hostile team cannot target the same player again to kill them. The dead person once revived by the bot or admin must leave the scenario with the hands raised",
            "Also, Bot Revived players CANNOT be taken hostage under any circumstances"
          ],
          "description": "If a player is revived by an Admin or automatically by the bot, the player must not involve themselves in the scenarios and must follow the New Life Rule."
        },
        {
          "title": "16. Bug Exploiting",
          "rules": [
            "The use of emotes during firing scenarios will be considered as bug exploiting (exempted are the firing styles given by the server). Bugs that give a unfair advantage will be counted under Bug Exploiting and Non-Realistic Roleplay"
          ]
        },
        {
          "title": "17. AFK Grinding",
          "rules": [
            "If an Admin sees you using exploits and mechanics such as auto-clickers and AFK grinding bots, we will kick you without warning",
            "If you have a whitelisted job and are AFK to receive the money from the job, you will be terminated from the job and character and assets removed"
          ],
          "description": "AFK Grinding is a serious offense and is not limited to just whitelisted jobs, being AFK within the server to complete the minimum time to join a gang will count towards AFK grinding."
        },
        {
          "title": "18. Dead Robbery and In Person Robbery",
          "rules": [
            "Dead Robbery is an FRP, you are not allowed to rob dead or knocked players under any circumstances",
            "You can only rob players if they are alive and you have them at gun-point with their hands raised in surrender",
            "You can only rob a maximum of 5 items and a maximum of 10 Lakh in either White or Black Money"
          ]
        },
        {
          "title": "19. Job Locations",
          "rules": [],
          "description": "Job Locations are safezones, you cannot trigger situations with players who are in the job locations or doing the job. Similarly you cannot enter a job to escape the situation."
        },
        {
          "title": "20. Guns Over Roleplay",
          "rules": [],
          "description": "Using Lethal force in the middle of communication, however, certain RP is known for violence, such as Gang RP, in which warning fire may help you to overcome this rule."
        },
        {
          "title": "21. Hostage Rules",
          "rules": [
            "You are not allowed to take players from your own team as hostages, these are referred to as \"fake hostages\". Also, you are not allowed to take more than 1 Hostage in any situation unless specified otherwise",
            "Hostages are not allowed to be held for more than 30 Mins under any circumstances",
            "You can only demand up to 30 Lakh in white money as your demand OR you can trade the hostage for a captured teammate",
            "If the Police is able to safely extract the hostage without overly putting the hostage at risk, they can look into those methods (under the Hostage Negotiation and Rescue SOP)",
            "You can only demand up to 15 Lakh in white money as your demand. You must value the life of the hostage and meet the demand of the hostage"
          ]
        }
      ]
    },
    {
      "title": "FINAL NOTES",
      "subsections": [],
      "description": "The following mentioned rules are guidelines to be followed by the players of XLANTIS CITY. They cover the basic Roleplay Guidelines to keep everyone's roleplay experience smooth and healthy. We cannot list out every rule, but most rules are down to common sense, what you can and cannot do, must come down to your own morality and sense to keep Roleplay fun for all parties."
    }
  ],
  "title": "XLANTIS CITY ROLEPLAY - BASIC ROLEPLAY RULES"
}