{
  "metadata": {
    "document_type": "Government Job Rules",
    "category": "Medical Department Guidelines",
    "last_updated": "2025",
    "server": "XLANTIS CITY ROLEPLAY"
  },
  "overview": "",
  "sections": [
    {
      "title": "OVERVIEW",
      "subsections": [],
      "description": "These guidelines are the basic set of rules to be followed by all parties engaged in the EMS RP and those interacting with the EMS in XLANTIS CITY ROLEPLAY."
    },
    {
      "title": "XMD GENERAL RULES",
      "subsections": [
        {
          "title": "General Rules to be Followed",
          "rules": [
            "**Respect:** Treat all players and staff with respect. No harassment, discrimination, or hate speech will be tolerated",
            "**No Metagaming:** Use only in-game knowledge for in-game actions. Don't use out-of-game information to gain an advantage",
            "**Character Immersion:** Stay in character as much as possible. Avoid breaking character unless necessary for administrative reasons",
            "**No Power Gaming:** Role-play situations realistically. Avoid unrealistic actions",
            "**Consent in RP:** Always get consent from other players before involving them in your role-play scenarios, especially if it involves sensitive topics",
            "**No God modding:** Don't control other players' characters without their consent. Respect their agency in the role-play",
            "**OOC (Out of Character) Communication:** Use appropriate channels for out-of-character communication, such as OOC chat or forums",
            "**No Cheating or Exploiting:** Do not use hacks, cheats, or exploits to gain an unfair advantage. Report any bugs or issues to the staff immediately",
            "**Follow Staff Instructions:** Listen to and cooperate with staff members. They're here to ensure a positive and fair gaming experience for everyone",
            "**Role-play Environment:** Keep the role-play environment immersive and engaging. Avoid disrupting others' experiences with disruptive behavior or actions"
          ]
        }
      ]
    },
    {
      "title": "XLANTIS MEDICAL DEPARTMENT (XMD) RULES",
      "subsections": [
        {
          "title": "General EMS Rules",
          "rules": [
            "**The EMS will NOT revive dead carried or burnt bodies**",
            "**Stealing an EMS vehicle will be considered as FRP**",
            "**Disrespectful Behaviour towards an EMS Officer will be considered as FRP**",
            "**EMS won't attend illegal area cases**",
            "**In case of on site killing, the body will be taken to hospital and then revived**",
            "**If you are playing around and shooting players for fun, the EMS will only revive you once, issuing a warning. If your name comes up again in the MDT, they will not revive you**"
          ]
        },
        {
          "title": "Situation Rules",
          "rules": [
            "**In a situation, if the EMS revives you, you can only continue a situation if the situation is in the a 4 Block Postal area**",
            "**In case of Police Situations, if you have been revived by an EMS Officer, you may attempt to run away, but you cannot attempt to fight back. The PD will use Non-Lethal force to capture you again**",
            "**If a Combat Medic (PD Unit) revives you, there is no option for escape. You must surrender immediately**"
          ]
        },
        {
          "title": "Operational Requirements",
          "rules": [
            "**EMS Units must be active within the city with a minimum of 4 Units at a given time**",
            "**Duty time will be from 7 AM to 12.30 AM**",
            "**Assets from the EMS are non-transferrable. Transferring assets will be met with strict action**",
            "**EMS Units are not allowed to engage in any sort of illegal activity while on-duty. If in case they are found engaging in illegal activity while off-duty, they will face a termination from Whitelisted Government Jobs**"
          ]
        }
      ],
      "description": "These guidelines are the basic set of rules to be followed by all parties engaged in the EMS RP and those interacting with the EMS."
    }
  ],
  "title": "XLANTIS CITY ROLEPLAY - EMS RULES"
}