{
  "metadata": {
    "document_type": "Government Job Rules",
    "category": "Police Department Guidelines",
    "last_updated": "2025",
    "server": "XLANTIS CITY ROLEPLAY"
  },
  "overview": "",
  "sections": [
    {
      "title": "OVERVIEW",
      "subsections": [],
      "description": "The following rules describe the basic set of rules to be followed by all parties including the police when interacting with each other in XLANTIS CITY ROLEPLAY."
    },
    {
      "title": "CITIZEN TOWARDS X-PD",
      "subsections": [
        {
          "title": "Communication and Behavior",
          "rules": [
            "**Respectful Communication:** Citizens must communicate with PD officers in a respectful manner, refraining from using abusive language or insults",
            "**Compliance:** Citizens are expected to comply with lawful orders given by PD officers during interactions, including requests for identification or questioning",
            "**Role-play Realism:** Maintain realistic role-play interactions with PD officers, avoiding unrealistic actions or behaviors that may disrupt immersion",
            "**No Harassment:** Citizens must not harass or intentionally provoke PD officers, as this can lead to disruptions in role-play and create a negative experience for everyone involved",
            "**Respect Personal Space:** Respect the personal space of PD officers during interactions, avoiding unnecessary physical contact or invasive behavior"
          ]
        },
        {
          "title": "Reporting and Cooperation",
          "rules": [
            "**Reporting Issues:** If a citizen believes they have been treated unfairly or witnessed misconduct by a PD officer, they should report the incident to server staff using the appropriate channels",
            "**Obedience to Laws:** Citizens should follow server rules and in-game laws when interacting with PD officers, avoiding actions that may lead to criminal charges or in-game penalties",
            "**No Metagaming:** Avoid using out-of-character knowledge to influence interactions with PD officers. Role-play situations realistically and authentically",
            "**Role-play Consent:** Obtain consent from PD officers before involving them in role-play scenarios, especially if it involves sensitive topics or actions that may affect their character's development",
            "**Cooperation:** Cooperate with PD officers during interactions, providing necessary information and assistance within the bounds of the role-play scenario"
          ]
        }
      ]
    },
    {
      "title": "X-PD TOWARDS CITIZENS",
      "subsections": [
        {
          "title": "Professional Conduct",
          "rules": [
            "**Professional Conduct:** PD officers must maintain a professional demeanor when interacting with citizens, ensuring that all interactions are conducted respectfully and without unnecessary aggression",
            "**Lawful Behavior:** PD officers must uphold server rules and in-game laws at all times during interactions with citizens, avoiding actions that may lead to abuse of power or misconduct",
            "**Role-play Realism:** PD officers should engage in realistic role-play interactions with citizens, considering potential outcomes based on the situation and context of the interaction"
          ]
        },
        {
          "title": "Use of Force and De-escalation",
          "rules": [
            "**Use of Force:** PD officers may use force when necessary to enforce the law and protect themselves or others from harm. However, the use of force must be proportional to the threat faced and should be employed only as a last resort",
            "**De-escalation:** PD officers are encouraged to use de-escalation techniques to resolve conflicts peacefully and minimize the need for forceful intervention whenever possible",
            "**PD officers may use only firearms to counter threats posed by robbers with firearms. Tasers are not authorized in this situation**"
          ]
        },
        {
          "title": "Rights and Accountability",
          "rules": [
            "**Respect for Rights:** PD officers must respect the rights of citizens, including the right to due process, freedom from unlawful search and seizure, and protection against discrimination",
            "**Documentation:** PD officers should document all interactions with citizens, including the reason for the interaction, actions taken, and any outcomes, to ensure accountability and transparency",
            "**Accountability:** PD officers are accountable for their actions and decisions during interactions with citizens. Any misconduct or abuse of power will be investigated and addressed by server staff accordingly"
          ]
        }
      ]
    },
    {
      "title": "BASIC POLICE RULES AND INTERACTION RULES",
      "subsections": [
        {
          "title": "Safezone and Arrest Rules",
          "rules": [
            "**Firing towards PD (Safe Zone) is considered as FRP (Fail Roleplay). If the PD is unable to leave the PD Safezone they are allowed to fire out of the Safezone. However, they are only allowed to hold the area for a maximum of 20 minutes**",
            "**PD has the right to arrest a player once a government-issued arrest warrant is in place, regardless of the location (Safe Zone, Gang House, City Limits)**"
          ]
        },
        {
          "title": "Situation Participation",
          "rules": [
            "**If a player isn't part of an ongoing robbery or shooting situation, then they're not supposed to get involved. Getting involved will be considered as FRP**",
            "**If you are caught with an illegal weapon in public, the PD has the power to handcuff you and confiscate the weapon**",
            "**All on-duty officers (officers who are available during the situation) can be involved in an unexpected or 144 situation**",
            "**An on-duty officer cannot be taken hostage or kidnapped**"
          ]
        },
        {
          "title": "Hostage and Demand Rules",
          "rules": [
            "**Taking a hostage for any kind of resource exchange, such as cash or other valuable items, against PD will be considered as FRP**"
          ]
        },
        {
          "title": "Revival and Re-entry Rules",
          "rules": [
            "**Dead players from both sides cannot re-enter a situation with PD unless the XMD has revived them. In this case, if the XMD has revived a suspect, the suspect can attempt to flee but cannot attack the PD**",
            "**If a Combat Medic has revived you, you cannot attempt to flee and must surrender immediately**"
          ]
        },
        {
          "title": "Combat and War Rules",
          "rules": [
            "**Players are not permitted to re-initiate or take part in a scenario in which a 144 has been issued. Open war cannot be declared against PD**"
          ]
        }
      ]
    },
    {
      "title": "HIERARCHY",
      "subsections": [
        {
          "title": "Authority Structure",
          "rules": [
            "**The hierarchy of PD shouldn't be based on the number of PD players or gun power. Even if it's a single PD officer, citizens (including gangs) should follow the hierarchy and act accordingly towards the police**"
          ]
        },
        {
          "title": "Firing Situations",
          "rules": [],
          "description": "Players cannot create an unwanted firing situation with the police. Players are allowed to fire at the PD only in the below scenarios:"
        },
        {
          "title": "Arrest and Compliance",
          "rules": [
            "**If PD tries to take you into custody when you commit a crime, then you can try to escape by running away, not by firing them. If PD cuffs you for the wrong reason, you can call an advocate or talk by yourself with a valid reason and proof. In any case, if the police arrest you without any reason, then players can raise a complaint in the complaint box (discord) against PD with proof or POV**",
            "**It's mandatory that you need to follow PD commands; such as, if an on-duty officer finds you carrying a gun, they will ask you to keep it inside and it's mandatory that you follow their command rather than denying and doing the exact opposite. PD can take you into custody if anything such happens**"
          ]
        },
        {
          "title": "Behavior and Cooperation",
          "rules": [
            "**Inappropriate behavior against PD won't be promoted. PD will only be talking to you with respect and they expect the same in return, you're only allowed to tease or criticize the PD if they start to do the same against you**",
            "**PD cannot jail or fine citizens without a solid reason**",
            "**If the suspect gives a good, valid reason that he or she didn't commit any crime, then the police have to cooperate with them. If a PD officer misuses their power, strict action will be taken**"
          ]
        },
        {
          "title": "Jurisdiction and Response",
          "rules": [
            "**PD won't attend or respond to any situations that occur outside the city limits unless they witness the situation firsthand or receive information about it**",
            "**Trespassing in any official government area is strictly prohibited, and the PD has the right to take action**"
          ]
        },
        {
          "title": "Water and Pursuit Rules",
          "rules": [
            "**In a robbery situation, if it ends in water, the police will use announcements to call the robber to shore. The robber should then return and surrender to the police in this scenario. Robbers can however, use boats and water based vehicles to escape if the escape RP has been pre-planned. You can only swim in the water for 5 Mins**"
          ]
        },
        {
          "title": "Traffic Stop Rules",
          "rules": [
            "**For Traffic Stop RPs, only the people inside the vehicle getting pulled over for the Traffic Stop are allowed to involve themselves with the stop. No other persons can involve themselves with that scenario**"
          ]
        }
      ]
    }
  ],
  "title": "XLANTIS CITY ROLEPLAY - POLICE DEPARTMENT RULES"
}